/**
 * 1. 计算机浮点数表示法：1个阶符，7个阶码E，1个数符，23个尾数M
 *    尾数的有效位第一位必须为1， 也就是小数点后第一位必须为1
 *    
 * 2. IEEE754标准32位浮点型: 1个数符m, 8个阶码E(用移码表示)，23个尾数M(原码表示)
 *    E = e + bias, e为真值补码， 偏置值bias = 2^(n-1) - 1 = 127
 *    尾数隐藏表示最高位为1， 即默认1.M (注意最高位和有效位的区别)
 * 
 *    运算规则：1.M x 2^E
 *      例: 178.125D = 10110010.001B = 1.0110010001 * 2^111
 *          符号位: 0
 *          阶数: 7 + 127 = 134 = 10000110
 *          尾数: .0110010001
 *          二进制存储形式: 0 10000110 0110010_00100000_00000000
 * 
 * 分子分母都是整形，结果会向下取整，一方是浮点型，结果就是浮点型
 */

#include <stdio.h>

int main()
{
    int   z = 10,   m1 = 4;
    float result1,  result2;

    result1 = z / m1;
    result2 = z / (float)m1;
    printf("10 / 4 = %.2f\n", result1);
    printf("10 / 4.0 = %.2f\n", (int)result2);
    return 0;
}